In [2]:
# standard imports
import numpy as np
import pandas as pd
# import scipy.stats as stats
# from sklearn import ...

# graphing imports
import matplotlib as mpl
import matplotlib.pyplot as plt
# import seaborn as sns

%matplotlib inline

In [3]:
# create a data frame from a table copied from wikipedia
calgary_df = pd.read_clipboard()

In [6]:
# display data frame information
calgary_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 0 to 10
Data columns (total 6 columns):
Rank      11 non-null int64
Nation    11 non-null object
Gold      11 non-null int64
Silver    11 non-null int64
Bronze    11 non-null int64
Total     11 non-null int64
dtypes: int64(5), object(1)
memory usage: 616.0+ bytes

In [7]:
# create a data frame by reading the clipboard using data copied out of Teradata
area1_df = pd.read_clipboard()

In [11]:
# create a series of random normal variables with a specified index
s1 = pd.Series(np.random.randn(10), index=list('ABCDEFGHIJ'))
s1

A    0.936689
B    1.631569
C   -0.356267
D    0.284706
E    0.490724
F   -0.149918
G    0.139905
H   -1.156840
I   -0.080856
J    2.051223
dtype: float64

In [15]:
# create a series with a custom index
s2 = pd.Series(np.arange(10)**2, index=list('ABCEGHIJKL'))
s2

A     0
B     1
C     4
E     9
G    16
H    25
I    36
J    49
K    64
L    81
dtype: int32

In [19]:
# add two pandas series together, and then drop the null values
s3 = s1 + s2
s3.dropna()

A     0.936689
B     2.631569
C     3.643733
E     9.490724
G    16.139905
H    23.843160
I    35.919144
J    51.051223
dtype: float64

In [4]:
# create a Pandas index of a date range
date_list = pd.date_range('20150101', periods=6, freq='D')
date_list

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# create a data frame with the date range index we just created
df1 = pd.DataFrame(np.random.randn(6, 4), index=date_list, columns=list('ABCD'))
df1

                   A         B         C         D
2015-01-01 -1.027007  0.295947  0.447634  0.585970
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-03 -0.111637  1.755979 -1.330637  1.299502
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-05  1.241920  2.000216  1.178503 -0.838917
2015-01-06  0.277866  0.535229  0.352055  0.021119

In [6]:
# create a data frame from a dictionary
df2 = pd.DataFrame({'A' : 1., 
                    'B' : pd.Timestamp('20160229'), 
                    'C' : pd.Series(1, index=list(range(4)), dtype='float32'), 
                    'D' : np.array([3] * 4, dtype = 'int32'), 
                    'E' : pd.Categorical(['test', 'train', 'test', 'train']), 
                    'F' : 'foo' 
                   })

df2

   A          B  C  D      E    F
0  1 2016-02-29  1  3   test  foo
1  1 2016-02-29  1  3  train  foo
2  1 2016-02-29  1  3   test  foo
3  1 2016-02-29  1  3  train  foo

In [7]:
# show the datatypes in our data frame
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
# display the top 5 (by default) rows of the data frame
df1.head()

                   A         B         C         D
2015-01-01 -1.027007  0.295947  0.447634  0.585970
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-03 -0.111637  1.755979 -1.330637  1.299502
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-05  1.241920  2.000216  1.178503 -0.838917

In [9]:
# display the last 3 rows of the data frame
df1.tail(3)

                   A         B         C         D
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-05  1.241920  2.000216  1.178503 -0.838917
2015-01-06  0.277866  0.535229  0.352055  0.021119

In [10]:
# show the data frame index
df1.index

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# show the data frame columns
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# show all the non-index or column-name values as a NumPy array
df1.values

array([[-1.02700749,  0.29594742,  0.44763425,  0.58596991],
       [ 0.83480722, -0.02698899,  1.42548681, -0.03401619],
       [-0.11163731,  1.75597877, -1.33063689,  1.29950236],
       [ 1.18333599, -1.38565376, -0.89176314, -2.31753881],
       [ 1.24192019,  2.0002164 ,  1.17850304, -0.83891669],
       [ 0.27786553,  0.53522917,  0.35205476,  0.02111865]])

In [13]:
# describe (quick summary statistics) on the data frame
df1.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.399881  0.529122  0.196880 -0.213980
std    0.874590  1.240913  1.102585  1.251696
min   -1.027007 -1.385654 -1.330637 -2.317539
25%   -0.014262  0.053745 -0.580809 -0.637692
50%    0.556336  0.415588  0.399845 -0.006449
75%    1.096204  1.450791  0.995786  0.444757
max    1.241920  2.000216  1.425487  1.299502

In [14]:
# transpose the data frame
df1.T

   2015-01-01  2015-01-02  2015-01-03  2015-01-04  2015-01-05  2015-01-06
A   -1.027007    0.834807   -0.111637    1.183336    1.241920    0.277866
B    0.295947   -0.026989    1.755979   -1.385654    2.000216    0.535229
C    0.447634    1.425487   -1.330637   -0.891763    1.178503    0.352055
D    0.585970   -0.034016    1.299502   -2.317539   -0.838917    0.021119

In [15]:
# sort the data frame using the index
df1.sort_index(axis=1, ascending=False)

                   D         C         B         A
2015-01-01  0.585970  0.447634  0.295947 -1.027007
2015-01-02 -0.034016  1.425487 -0.026989  0.834807
2015-01-03  1.299502 -1.330637  1.755979 -0.111637
2015-01-04 -2.317539 -0.891763 -1.385654  1.183336
2015-01-05 -0.838917  1.178503  2.000216  1.241920
2015-01-06  0.021119  0.352055  0.535229  0.277866

In [16]:
# sort the data frame by non-index values
df1.sort_values(by='B')

                   A         B         C         D
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-01 -1.027007  0.295947  0.447634  0.585970
2015-01-06  0.277866  0.535229  0.352055  0.021119
2015-01-03 -0.111637  1.755979 -1.330637  1.299502
2015-01-05  1.241920  2.000216  1.178503 -0.838917

In [17]:
# call a column in the data frame as a series
df1.A

2015-01-01   -1.027007
2015-01-02    0.834807
2015-01-03   -0.111637
2015-01-04    1.183336
2015-01-05    1.241920
2015-01-06    0.277866
Freq: D, Name: A, dtype: float64

In [18]:
# call a column in the data frame as a series
df1['A']

2015-01-01   -1.027007
2015-01-02    0.834807
2015-01-03   -0.111637
2015-01-04    1.183336
2015-01-05    1.241920
2015-01-06    0.277866
Freq: D, Name: A, dtype: float64

In [23]:
# slice the data frame using positions
df1[0:3]

                   A         B         C         D
2015-01-01 -1.027007  0.295947  0.447634  0.585970
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-03 -0.111637  1.755979 -1.330637  1.299502

In [24]:
# slice the data frame using index values
df1['2015-01-02':'2015-01-05']

                   A         B         C         D
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-03 -0.111637  1.755979 -1.330637  1.299502
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-05  1.241920  2.000216  1.178503 -0.838917

In [25]:
# remember what the date list index that we made looks like
date_list

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
# you can slide the date list like any other iterable in Python
date_list[0]

Timestamp('2015-01-01 00:00:00', offset='D')

In [28]:
# call .loc to return a row as a series based on a supplied index
df1.loc['2015-01-03']

A   -0.111637
B    1.755979
C   -1.330637
D    1.299502
Name: 2015-01-03 00:00:00, dtype: float64

In [27]:
# you can also do this by slicing the index
df1.loc[date_list[0]]

A   -1.027007
B    0.295947
C    0.447634
D    0.585970
Name: 2015-01-01 00:00:00, dtype: float64

In [29]:
# data frame slicing
df1.loc[:, ['A', 'B']]

                   A         B
2015-01-01 -1.027007  0.295947
2015-01-02  0.834807 -0.026989
2015-01-03 -0.111637  1.755979
2015-01-04  1.183336 -1.385654
2015-01-05  1.241920  2.000216
2015-01-06  0.277866  0.535229

In [30]:
# data frame slicing
df1.loc['2015-01-02':'2015-01-05', ['A', 'B']]

                   A         B
2015-01-02  0.834807 -0.026989
2015-01-03 -0.111637  1.755979
2015-01-04  1.183336 -1.385654
2015-01-05  1.241920  2.000216

In [31]:
# data frame slicing
df1.loc['2015-01-04', ['B', 'C']]

B   -1.385654
C   -0.891763
Name: 2015-01-04 00:00:00, dtype: float64

In [32]:
# data frame slicing
df1.loc['2015-01-01', 'B']

0.29594742497582394

In [34]:
# data frame slicing by position
df1.iloc[3]

A    1.183336
B   -1.385654
C   -0.891763
D   -2.317539
Name: 2015-01-04 00:00:00, dtype: float64

In [35]:
# data frame slicing by position
df1.iloc[3:5, 0:2]

                   A         B
2015-01-04  1.183336 -1.385654
2015-01-05  1.241920  2.000216

In [37]:
# data frames with conditions
# pull any rows where the value in column A is > 0
df1[df1.A > 0]

                   A         B         C         D
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-05  1.241920  2.000216  1.178503 -0.838917
2015-01-06  0.277866  0.535229  0.352055  0.021119

In [38]:
# data frames with conditions
# pull any rows where the value in column A is > 0
df1[df1['A'] > 0]

                   A         B         C         D
2015-01-02  0.834807 -0.026989  1.425487 -0.034016
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539
2015-01-05  1.241920  2.000216  1.178503 -0.838917
2015-01-06  0.277866  0.535229  0.352055  0.021119

In [40]:
# data frame with conditions
# show any cell where the value is > 0
df1[df1 > 0]

                   A         B         C         D
2015-01-01       NaN  0.295947  0.447634  0.585970
2015-01-02  0.834807       NaN  1.425487       NaN
2015-01-03       NaN  1.755979       NaN  1.299502
2015-01-04  1.183336       NaN       NaN       NaN
2015-01-05  1.241920  2.000216  1.178503       NaN
2015-01-06  0.277866  0.535229  0.352055  0.021119

In [41]:
# create a new data frame as a copy of an existing data frame
df2 = df1.copy()

In [43]:
# print the IDs of both data frames, to show that they're separate objects in memory
print(id(df1), id(df2), sep='\n')

108138168
109914264

In [44]:
# create a new column 
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2015-01-01 -1.027007  0.295947  0.447634  0.585970    one
2015-01-02  0.834807 -0.026989  1.425487 -0.034016    one
2015-01-03 -0.111637  1.755979 -1.330637  1.299502    two
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539  three
2015-01-05  1.241920  2.000216  1.178503 -0.838917   four
2015-01-06  0.277866  0.535229  0.352055  0.021119  three

In [48]:
# use the "is in" method to test for inclusion
# show Booleans for column E testing for inclusion criteria
df2['E'].isin(['two', 'four'])

2015-01-01    False
2015-01-02    False
2015-01-03     True
2015-01-04    False
2015-01-05     True
2015-01-06    False
Freq: D, Name: E, dtype: bool

In [49]:
# another form of the syntax where you can use "is in"
# display all rows where column E has the value 'two' or 'four'
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2015-01-03 -0.111637  1.755979 -1.330637  1.299502   two
2015-01-05  1.241920  2.000216  1.178503 -0.838917  four

In [50]:
# create a new series
s1 = pd.Series(np.arange(1, 7), index=pd.date_range('20150101', periods=6))
s1

2015-01-01    1
2015-01-02    2
2015-01-03    3
2015-01-04    4
2015-01-05    5
2015-01-06    6
Freq: D, dtype: int32

In [52]:
# add that new series to our existing data frame
df2['F'] = s1

In [53]:
# display the data frame
df2

                   A         B         C         D      E  F
2015-01-01 -1.027007  0.295947  0.447634  0.585970    one  1
2015-01-02  0.834807 -0.026989  1.425487 -0.034016    one  2
2015-01-03 -0.111637  1.755979 -1.330637  1.299502    two  3
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539  three  4
2015-01-05  1.241920  2.000216  1.178503 -0.838917   four  5
2015-01-06  0.277866  0.535229  0.352055  0.021119  three  6

In [56]:
# use the .at method to pull a single value by specifying the index and column
df2.at[date_list[0], 'F']

1

In [57]:
# use the .at method
df2.at[date_list[0], 'F'] = 0
df2

                   A         B         C         D      E  F
2015-01-01 -1.027007  0.295947  0.447634  0.585970    one  0
2015-01-02  0.834807 -0.026989  1.425487 -0.034016    one  2
2015-01-03 -0.111637  1.755979 -1.330637  1.299502    two  3
2015-01-04  1.183336 -1.385654 -0.891763 -2.317539  three  4
2015-01-05  1.241920  2.000216  1.178503 -0.838917   four  5
2015-01-06  0.277866  0.535229  0.352055  0.021119  three  6

In [58]:
# use .iat to do the same this with positional arguments
df2.iat[1, 1] = -10
df2

                   A          B         C         D      E  F
2015-01-01 -1.027007   0.295947  0.447634  0.585970    one  0
2015-01-02  0.834807 -10.000000  1.425487 -0.034016    one  2
2015-01-03 -0.111637   1.755979 -1.330637  1.299502    two  3
2015-01-04  1.183336  -1.385654 -0.891763 -2.317539  three  4
2015-01-05  1.241920   2.000216  1.178503 -0.838917   four  5
2015-01-06  0.277866   0.535229  0.352055  0.021119  three  6

In [65]:
# overwrite column D in our data frame
df2.loc[:, 'D'] = np.array([5] * len(df2))
df2

                   A          B         C  D      E  F
2015-01-01 -1.027007   0.295947  0.447634  5    one  0
2015-01-02  0.834807 -10.000000  1.425487  5    one  2
2015-01-03 -0.111637   1.755979 -1.330637  5    two  3
2015-01-04  1.183336  -1.385654 -0.891763  5  three  4
2015-01-05  1.241920   2.000216  1.178503  5   four  5
2015-01-06  0.277866   0.535229  0.352055  5  three  6

In [76]:
# create a new data frame from our existing one using .reindex
df3 = df2.reindex(index=date_list[0:4], columns=list(df1.columns) + ['E'])

In [77]:
# show the new data frame
df3

                   A          B         C  D      E
2015-01-01 -1.027007   0.295947  0.447634  5    one
2015-01-02  0.834807 -10.000000  1.425487  5    one
2015-01-03 -0.111637   1.755979 -1.330637  5    two
2015-01-04  1.183336  -1.385654 -0.891763  5  three